In [2]:
import pandas as pd
import numpy as np

In [ ]:
# Create Data
stuff = {
    'Corporation': ['Apple', 'Google', 'Meta', 'Apple', 'Google', 'Meta'],
    'Employees': ['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary': [200, 220, 190, 130, 120, 150]
}

In [33]:
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [34]:
# Creates function
def times1000(x):
    return x * 1000

In [35]:
# Use apply function
my_df['Salary'].apply(times1000)

0    200000
1    220000
2    190000
3    130000
4    120000
5    150000
Name: Salary, dtype: int64

In [36]:
# Make it into a Dataframe
pd.DataFrame(my_df['Salary'].apply(times1000))

   Salary
0  200000
1  220000
2  190000
3  130000
4  120000
5  150000

In [37]:
# Namer Function
def namer(x):
    if x == 'John':
        return 'John Elder'
    else:
        return x

In [38]:
# Apply to Employees column
my_df['Employees'].apply(namer)

0    John Elder
1         April
2           Wes
3          Beth
4        Justin
5         Steph
Name: Employees, dtype: str

In [39]:
# Use Lambda instead
my_df['Salary'].apply(lambda x: x * 1000)

0    200000
1    220000
2    190000
3    130000
4    120000
5    150000
Name: Salary, dtype: int64

In [40]:
# Lambda with formatting
my_df['Salary'].apply(lambda x: f"{x * 1000:,d}")

0    200,000
1    220,000
2    190,000
3    130,000
4    120,000
5    150,000
Name: Salary, dtype: str

In [41]:
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [42]:
# Permanent change to a single column
my_df['Salary'] = my_df['Salary'].apply(times1000)
my_df

  Corporation Employees  Salary
0       Apple      John  200000
1      Google     April  220000
2        Meta       Wes  190000
3       Apple      Beth  130000
4      Google    Justin  120000
5        Meta     Steph  150000

In [43]:
# Define a function for multiple columns
def Namer(x):
    return "Test: " + x

In [44]:
# Apply function to multiple columns (Corporation and Employees)
# Note the double brackets [[]]
my_df[['Corporation', 'Employees']].apply(Namer)

    Corporation     Employees
0   Test: Apple    Test: John
1  Test: Google   Test: April
2    Test: Meta     Test: Wes
3   Test: Apple    Test: Beth
4  Test: Google  Test: Justin
5    Test: Meta   Test: Steph